In [1]:
import pandas as pd
from functions import *

url = "df_limpio.csv"
df = read_data(url)

In [2]:
df = clean_original_data(df)
df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92
...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17

In [3]:
country = new_df_country(df)
country

   id_country     country_name
0          AT          Austria
1          BE          Belgium
2          BG         Bulgaria
3          CH          Croatia
4          CY           Cyprus
5          CZ          Czechia
6          DE          Denmark
7          DK          Estonia
8          EE          Finland
9          EL           France
10         ES          Germany
11         FI           Greece
12         FR          Hungary
13         HR          Iceland
14         HU          Ireland
15         IE            Italy
16         IS           Latvia
17         IT        Lithuania
18         LT      Netherlands
19         LV  North Macedonia
20         MK           Norway
21         NL           Poland
22         NO         Portugal
23         PL          Romania
24         PT           Serbia
25         RO         Slovakia
26         RS         Slovenia
27         SE            Spain
28         SI           Sweden
29         SK      Switzerland
30         TR          Türkiye
31         UK   United Kingdom

In [4]:
gender = new_df_gender(df)
gender

  id_gender   gender
0         F  Females
1         M    Males

In [5]:
level_education = new_df_level(df)
level_education

      id_level  valor_educacion
0          ESO                1
1      BACH-FP                3
2         BACH                4
3           FP                2
4  UNIVERSIDAD                5

In [7]:
# Aplicar la función a la columna
df['id_gender'] = df['sex'].apply(convert_gender)
df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo,id_gender
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84,F
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89,F
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91,F
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92,F
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92,F
...,...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14,M
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14,M
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14,M
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17,M
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17,M

In [8]:
df = colum_id_map(df)
df

,sex,age,level_education,country,year,value_unemployment,value_education,valor_educacion,indice_educativo,id_gender,id_country
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84,F,AT
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89,F,AT
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91,F,AT
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92,F,AT
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92,F,AT
...,...,...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14,M,UK
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14,M,UK
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14,M,UK
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17,M,UK
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17,M,UK

In [9]:
df = rename_column_and_new_column(df)
df

,sex,age,id_level,country,year,value_unemployment,value_education,valor_educacion,indice_educativo,id_gender,id_country,id_datos
0,Females,15-29,ESO,Austria,2014,15.7,27.9,1,2.84,F,AT,1
1,Females,15-29,ESO,Austria,2015,15.3,27.5,1,2.89,F,AT,2
2,Females,15-29,ESO,Austria,2016,17.1,27.3,1,2.91,F,AT,3
3,Females,15-29,ESO,Austria,2017,16.8,27.2,1,2.92,F,AT,4
4,Females,15-29,ESO,Austria,2018,13.4,27.1,1,2.92,F,AT,5
...,...,...,...,...,...,...,...,...,...,...,...,...
4636,Males,15-29,UNIVERSIDAD,United Kingdom,2015,6.2,26.6,5,3.14,M,UK,3110
4637,Males,15-29,UNIVERSIDAD,United Kingdom,2016,5.3,27.1,5,3.14,M,UK,3111
4638,Males,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,27.1,5,3.14,M,UK,3112
4639,Males,15-29,UNIVERSIDAD,United Kingdom,2018,5.0,28.1,5,3.17,M,UK,3113
4640,Males,15-29,UNIVERSIDAD,United Kingdom,2019,5.9,28.7,5,3.17,M,UK,3114

In [10]:
datos_edu = new_df_datos(df)
datos_edu

,id_datos,indice_educativo,value_unemployment,value_education,year,id_country,id_gender,id_level
0,1,2.84,15.7,27.9,2014,AT,F,ESO
1,2,2.89,15.3,27.5,2015,AT,F,ESO
2,3,2.91,17.1,27.3,2016,AT,F,ESO
3,4,2.92,16.8,27.2,2017,AT,F,ESO
4,5,2.92,13.4,27.1,2018,AT,F,ESO
...,...,...,...,...,...,...,...,...
4636,3110,3.14,6.2,26.6,2015,UK,M,UNIVERSIDAD
4637,3111,3.14,5.3,27.1,2016,UK,M,UNIVERSIDAD
4638,3112,3.14,4.6,27.1,2017,UK,M,UNIVERSIDAD
4639,3113,3.17,5.0,28.1,2018,UK,M,UNIVERSIDAD
4640,3114,3.17,5.9,28.7,2019,UK,M,UNIVERSIDAD

In [11]:
datos_edu.sample(20)

,id_datos,indice_educativo,value_unemployment,value_education,year,id_country,id_gender,id_level
4480,3004,2.82,21.3,26.1,2023,TR,F,UNIVERSIDAD
3552,2376,2.67,32.6,12.3,2015,RS,F,BACH
4057,2731,2.83,30.7,24.1,2020,ES,M,BACH
163,114,2.96,13.0,37.4,2017,BE,F,BACH-FP
1255,856,2.63,27.5,34.6,2019,FI,M,ESO
4445,2969,2.49,26.1,25.4,2018,TR,F,BACH-FP
835,586,2.48,2.0,46.6,2019,CZ,M,FP
95,96,2.70,4.5,22.7,2019,AT,M,UNIVERSIDAD
1656,1107,3.07,49.3,29.5,2020,EL,F,ESO
4217,2841,2.73,7.2,20.3,2020,SE,M,FP
1098,749,2.90,7.0,24.1,2022,EE,F,UNIVERSIDAD
171,122,2.95,15.9,19.7,2015,BE,F,BACH
461,312,2.76,35.0,56.9,2015,HR,F,BACH-FP
4453,2977,2.39,25.9,13.5,2016,TR,F,BACH
911,612,2.80,8.9,37.5,2015,DK,F,BACH-FP
2853,1908,2.80,47.2,20.0,2017,MK,F,BACH
928,629,2.92,8.9,28.8,2022,DK,F,BACH
1289,890,2.59,10.6,28.3,2023,FI,M,FP
2597,1752,2.90,22.1,33.4,2023,LT,M,ESO
1557,1058,2.58,11.0,41.3,2021,DE,M,ESO

In [14]:
from sqlalchemy import create_engine, text

In [13]:
import pymysql

In [19]:
# Tus parámetros de conexión
bd = "project_ue"
password = "cambia_contraseña"  # Asegúrate de reemplazar esto con tu contraseña real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'country'
country.to_sql(table_name, con=engine, if_exists='append', index=False)

32

In [20]:
bd = "project_ue"
password = "cambia_contraseña"  # Asegúrate de reemplazar esto con tu contraseña real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'gender'
gender.to_sql(table_name, con=engine, if_exists='append', index=False)

2

In [21]:
bd = "project_ue"
password = "cambia_contraseña"  # Asegúrate de reemplazar esto con tu contraseña real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'datos_educativos'
datos_edu.to_sql(table_name, con=engine, if_exists='append', index=False)

3114

In [22]:
bd = "project_ue"
password = "cambia_contraseña"  # Asegúrate de reemplazar esto con tu contraseña real
connection_string = 'mysql+pymysql://root:' + password + '@localhost/' + bd
engine = create_engine(connection_string)

# Enviar DataFrame a MySQL
table_name = 'level_education'
level_education.to_sql(table_name, con=engine, if_exists='append', index=False)

5